In [1]:
# Import the json module.
import json
# Assign the string data to a variable. 
data = "{'contact_id': 4661, 'name': 'Cecilia Velasco', 'email': 'cecilia.velasco@rodrigues.fr'}"

data = data.replace("'", '"')
# Convert the string data to a dictionary.
converted_data = json.loads(data)
# Iterate through the dictionary (row) and get the values.
row_values = [v for k, v in converted_data.items()]
print(row_values)

[4661, 'Cecilia Velasco', 'cecilia.velasco@rodrigues.fr']

In [2]:
# Import the regular expression module.
import re
# Assign the string data to a variable. 
string_data = "contact_id 4661 name Cecilia Velasco email cecilia.velasco@rodrigues.fr"
# Extract the four digit number.
contact_id = re.findall(r'(\d{4})', string_data)
print(contact_id)

['4661']

In [3]:
# Import Pandas dependency
import pandas as pd

# Read the contacts string data into a Pandas dataframe
contact_string_df = pd.read_csv("resources/contacts_string_data.csv")
contact_string_df.head()

                                        contact_info
0  contact_id 4661 name Cecilia Velasco email cec...
1  contact_id 3765 name Mariana Ellis email maria...
2  contact_id 4187 name Sofie Woods email sofie.w...
3  contact_id 4941 name Jeanette Iannotti email j...
4  contact_id 2199 name Samuel Sorgatz email samu...

In [4]:
# Extract the four-digit contact ID number.
contact_string_df['contact_id'] = contact_string_df['contact_info'].str.extract(r'([\d]{4})', expand=True)
contact_string_df.head()

                                        contact_info contact_id
0  contact_id 4661 name Cecilia Velasco email cec...       4661
1  contact_id 3765 name Mariana Ellis email maria...       3765
2  contact_id 4187 name Sofie Woods email sofie.w...       4187
3  contact_id 4941 name Jeanette Iannotti email j...       4941
4  contact_id 2199 name Samuel Sorgatz email samu...       2199

In [8]:
# Extract the first and last name after the word "name". 
name = re.findall(r'(?:name\s)([A-Za-z]+\s+[A-Za-z]+)', string_data)
name

['Cecilia Velasco']

In [15]:
contact_string_df['name'] = contact_string_df["contact_info"].str.extract(r'(?:name\s)([A-Za-z]+\s+[A-Za-z]+)', expand=True)
contact_string_df.sample(10)

,contact_info,contact_id,name
621,contact_id 4676 name Hannah Jockel email hanna...,4676,Hannah Jockel
684,contact_id 1877 name Kirsten Chindamo email ki...,1877,Kirsten Chindamo
382,contact_id 2511 name Janet Madrigal email jane...,2511,Janet Madrigal
452,contact_id 2896 name Mathew Maestas email math...,2896,Mathew Maestas
794,contact_id 3607 name Cristal Mazzini email cri...,3607,Cristal Mazzini
482,contact_id 1494 name Iris Trincavelli email ir...,1494,Iris Trincavelli
876,contact_id 5983 name Damian Pulido email damia...,5983,Damian Pulido
65,contact_id 3631 name Ubaldo Brown email ubaldo...,3631,Ubaldo Brown
301,contact_id 5419 name Vanessa Tschentscher emai...,5419,Vanessa Tschentscher
717,contact_id 2243 name Leif Monnier email leif.m...,2243,Leif Monnier

In [16]:
contact_string_df['email'] = contact_string_df['contact_info'].str.extract(r'(?:email\s)([^\s@]+@[^\s@]+)', expand=True)
contact_string_df.head()

,contact_info,contact_id,name,email
0,contact_id 4661 name Cecilia Velasco email cec...,4661,Cecilia Velasco,cecilia.velasco@rodrigues.fr
1,contact_id 3765 name Mariana Ellis email maria...,3765,Mariana Ellis,mariana.ellis@rossi.org
2,contact_id 4187 name Sofie Woods email sofie.w...,4187,Sofie Woods,sofie.woods@riviere.com
3,contact_id 4941 name Jeanette Iannotti email j...,4941,Jeanette Iannotti,jeanette.iannotti@yahoo.com
4,contact_id 2199 name Samuel Sorgatz email samu...,2199,Samuel Sorgatz,samuel.sorgatz@gmail.com